[XComGame.X2SoldierClassTemplate]
[RM_JulianClass X2SoldierClassTemplate]
+DisplayName="Gunner"
+FirstName="Julian"
+LastName="Shen"
+Nickname="Julian"
+ClassSummary="<b>Role:</b> Disorienting Attacks, Aggressive Tanking"
+ClassBio="Artifical Intelligence / 25? / 2015 XCOM HQ"
+ClassQuote="\"A quote? Here's a simple one: I'll still be around even after the rest of you organics are dead.\""
+ClassLongBio="<b>Old World Origin:</b> Creation of Dr. Raymond Shen as an early prototype AI.\n<b>Prior to Invasion:</b> Was tinkered with on the side as Dr. Shen focused on XCOM's activation.\n<b>2015 Invasion:</b> Was captured alongside with the rest of XCOM HQ, repurposed for large scale MEC creation.\n<b>2016-2034 Occupation:</b>Eventually gained independence and went rogue against his alien masters. Was effectively locked up in the early MEC production plant as a result, and spent decades figuring out a way to escape his fate.\n<b>2035 War For Liberation:</b> Lured Lily Shen and the Avenger to his location for the purposes of escape. Ended up being responsible for the rediscovery of the SPARK program, and was later reprogrammed as one of XCOM's most effective SPARK units.<br /><b>To Present:</b> Lily Shen has admitted a fondness for a remnant of her father and decided to try \"rehabilitaitng\" Julian instead of continuing to use his repogramming. Lily suggested placement in Reclamation Agency for Julian as a final test of sorts after the past five years. Surprisingly passed Chimera Squad field evaluations, apparently preferring to \"get this over with as soon as possible\", demonstrating high tactical excellence with his new Android body."

[WPN_RM_JulianRifle X2WeaponTemplate]
FriendlyName="Battle Rifle"
FriendlyNamePlural="Battle Rifles"
BriefSummary="A specialized version of the common Assault Rifle, made to Julian's specifications. Hits hard, but is also a bit wild to control."
TacticalText="<Bullet/> Firing the primary weapon ends the Agent's turn, in the absence of special training."
AbilityDescName="battle rifle"

[RM_JulianSkirmisherStrike X2AbilityTemplate]
LocFriendlyName="Battle Droid"
LocHelpText="Standard fire costs one action and do not automatically end the turn if <Ability:NickName/> has actions remaining."
LocLongDescription="Standard fire costs one action and do not automatically end the turn if <Ability:NickName/> has actions remaining."
LocFlyOverText="Battle Droid"

[SkirmisherStrike X2AbilityTemplate]
LocFriendlyName="Battle Droid"
LocHelpText="Standard fire costs one action and do not automatically end the turn if <Ability:NickName/> has actions remaining."
LocLongDescription="Standard fire costs one action and do not automatically end the turn if <Ability:NickName/> has actions remaining."
LocFlyOverText="Battle Droid"

[RM_BreachJulianAbility X2AbilityTemplate]
LocFriendlyName="Demolition"
LocHelpText="Fire the rifle at a target, destroying their cover even if it misses."
LocLongDescription="<Ability:NickName/> fires the rifle at a target, destroying their cover even if it misses."
LocFlyOverText="Demolition"

[RM_JulianHello X2AbilityTemplate]
LocFriendlyName="Hello There"
LocHelpText="The first two shots in each mag destroys the cover of the target, even if they miss."
LocLongDescription="The first two shots in each mag destroys the cover of the target, even if they miss."
LocFlyOverText="Hello There"

[RM_JulianReflexes X2AbilityTemplate]
LocFriendlyName="Robotic Reflexes"
LocLongDescription="<Ability:NICKNAME/> gains +<Ability:JULIANREFLEXES/> Aim on Overwatch and other reaction shots, and they can critically hit."
LocHelpText="Bonus aim and chance to crit on Overwatch and reaction shots."
LocFlyOverText="Robotic Reflexes"

[RM_JulianKillConfirm X2AbilityTemplate]
LocFriendlyName="Kill Confirm"
LocHelpText="The last two shots in each mag deals double damage."
LocLongDescription="The last two shots in each mag deals double damage."
LocFlyOverText="Kill Confirm"